read_verilog -formal encryptor_top.v
prep -top encryptor_top
flatten
memory -nomap
uniquify
hierarchy -check
setundef -undriven -init -expose
sim -clock clk1 -w encryptor_top
write_btor -s encryptor_top_one_round.btor2