read_verilog -formal cond_mul.v
prep -top alu_miter
flatten
memory -nordff
setundef -undriven -init -expose
techmap
abc -fast -g AND
write_aiger cond_mul_64_input.aig